balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18C658.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D40" edc:desc="" edc:mask="0x1" edc:name="RXB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D41" edc:desc="" edc:mask="0x1" edc:name="RXB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D42" edc:desc="" edc:mask="0x1" edc:name="RXB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D43" edc:desc="" edc:mask="0x1" edc:name="RXB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D44" edc:desc="" edc:mask="0x1" edc:name="RXB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D45" edc:desc="" edc:mask="0x1" edc:name="RXB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D46" edc:desc="" edc:mask="0x1" edc:name="RXB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D47" edc:desc="" edc:mask="0x1" edc:name="RXB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D40" edc:desc="" edc:mask="0x1" edc:name="RB0D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D41" edc:desc="" edc:mask="0x1" edc:name="RB0D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D42" edc:desc="" edc:mask="0x1" edc:name="RB0D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D43" edc:desc="" edc:mask="0x1" edc:name="RB0D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D44" edc:desc="" edc:mask="0x1" edc:name="RB0D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D45" edc:desc="" edc:mask="0x1" edc:name="RB0D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D46" edc:desc="" edc:mask="0x1" edc:name="RB0D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D47" edc:desc="" edc:mask="0x1" edc:name="RB0D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D50" edc:desc="" edc:mask="0x1" edc:name="RXB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D51" edc:desc="" edc:mask="0x1" edc:name="RXB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D52" edc:desc="" edc:mask="0x1" edc:name="RXB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D53" edc:desc="" edc:mask="0x1" edc:name="RXB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D54" edc:desc="" edc:mask="0x1" edc:name="RXB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D55" edc:desc="" edc:mask="0x1" edc:name="RXB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D56" edc:desc="" edc:mask="0x1" edc:name="RXB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D57" edc:desc="" edc:mask="0x1" edc:name="RXB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D50" edc:desc="" edc:mask="0x1" edc:name="RB0D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D51" edc:desc="" edc:mask="0x1" edc:name="RB0D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D52" edc:desc="" edc:mask="0x1" edc:name="RB0D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D53" edc:desc="" edc:mask="0x1" edc:name="RB0D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D54" edc:desc="" edc:mask="0x1" edc:name="RB0D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D55" edc:desc="" edc:mask="0x1" edc:name="RB0D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D56" edc:desc="" edc:mask="0x1" edc:name="RB0D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D57" edc:desc="" edc:mask="0x1" edc:name="RB0D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D60" edc:desc="" edc:mask="0x1" edc:name="RXB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D61" edc:desc="" edc:mask="0x1" edc:name="RXB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D62" edc:desc="" edc:mask="0x1" edc:name="RXB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D63" edc:desc="" edc:mask="0x1" edc:name="RXB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D64" edc:desc="" edc:mask="0x1" edc:name="RXB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D65" edc:desc="" edc:mask="0x1" edc:name="RXB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D66" edc:desc="" edc:mask="0x1" edc:name="RXB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D67" edc:desc="" edc:mask="0x1" edc:name="RXB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D60" edc:desc="" edc:mask="0x1" edc:name="RB0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D61" edc:desc="" edc:mask="0x1" edc:name="RB0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D62" edc:desc="" edc:mask="0x1" edc:name="RB0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D63" edc:desc="" edc:mask="0x1" edc:name="RB0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D64" edc:desc="" edc:mask="0x1" edc:name="RB0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D65" edc:desc="" edc:mask="0x1" edc:name="RB0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D66" edc:desc="" edc:mask="0x1" edc:name="RB0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D67" edc:desc="" edc:mask="0x1" edc:name="RB0D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
